In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from sqlalchemy import create_engine
from getpass import getpass

In [ ]:
df_final_demo = pd.read_csv('./df_final_demo.txt', delimiter=',')
df_final_demo.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [4]:
df_final_demo.nunique().sort_values(ascending=False)

client_id           70609
bal                 70328
clnt_tenure_mnth      482
clnt_age              165
clnt_tenure_yr         54
logons_6_mnth           9
num_accts               8
calls_6_mnth            8
gendr                   4
dtype: int64

In [5]:
df_final_demo.dtypes
df_final_demo.shape
print(df_final_demo.dtypes)
print(df_final_demo.shape)

client_id             int64
clnt_tenure_yr      float64
clnt_tenure_mnth    float64
clnt_age            float64
gendr                object
num_accts           float64
bal                 float64
calls_6_mnth        float64
logons_6_mnth       float64
dtype: object
(70609, 9)

In [6]:
df_web_data_1 = pd.read_csv('./df_final_web_data_pt_1.txt', delimiter=',')
df_web_data_1.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [7]:
df_web_data_1.nunique().sort_values(ascending=False)

date_time       282666
visit_id         75256
visitor_id       62936
client_id        58391
process_step         5
dtype: int64

In [8]:
df_web_data_1.dtypes
df_web_data_1.shape
print(df_web_data_1.dtypes)
print(df_web_data_1.shape)

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object
(343141, 5)

In [21]:
df_web_data_2 = pd.read_csv('./df_final_web_data_pt_2.txt', delimiter=',')
df_web_data_2.head(10)

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
5,6019349,442094451_91531546617,154620534_35331068705_522317,start,2017-06-01 11:57:54
6,4726500,934350987_45569789638,467318052_88159801968_565608,confirm,2017-06-05 17:38:52
7,4726500,934350987_45569789638,467318052_88159801968_565608,step_3,2017-06-05 17:38:33
8,4726500,934350987_45569789638,467318052_88159801968_565608,step_2,2017-06-05 17:37:31
9,4726500,934350987_45569789638,467318052_88159801968_565608,step_1,2017-06-05 17:37:24

In [10]:
df_web_data_2.nunique().sort_values(ascending=False)

date_time       346697
visit_id         82841
visitor_id       71042
client_id        67430
process_step         5
dtype: int64

In [11]:
df_web_data_2.dtypes
df_web_data_2.shape
print(df_web_data_2.dtypes)
print(df_web_data_2.shape)

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object
(412264, 5)

In [12]:
df_ab_clients = pd.read_csv('./df_final_experiment_clients.txt', delimiter=',')
df_ab_clients.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [13]:
df_ab_clients.nunique().sort_values(ascending=False)

client_id    70609
Variation        2
dtype: int64

In [14]:
df_ab_clients.dtypes
df_ab_clients.shape
print(df_ab_clients.dtypes)
print(df_ab_clients.shape)

client_id     int64
Variation    object
dtype: object
(70609, 2)

In [15]:
pwd = getpass()

In [16]:
user = "root"
db = "vanguard"

con = create_engine(f"mysql+pymysql://{user}:{pwd}@localhost/{db}")

In [17]:
df_final_demo.to_sql("final_demo", con = con, if_exists="append", chunksize=50)

70609

In [18]:
df_web_data_1.to_sql("web_data_1", con = con, if_exists="append", chunksize=50)

343141

In [19]:
df_web_data_2.to_sql("web_data_2", con = con, if_exists="append", chunksize=50)

412264

In [20]:
df_ab_clients.to_sql("ab_clients", con = con, if_exists="append", chunksize=50)

70609